Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/fuses.h
#define FUSES_DEVCFG1_CAN0_PIN_EN_Pos         _UINT32_(2)                                          /* (FUSES_DEVCFG1) CAN0 Pin Enable Position */
#define FUSES_DEVCFG1_CAN0_PIN_EN_Msk         (_UINT32_(0x1) << FUSES_DEVCFG1_CAN0_PIN_EN_Pos)     /* (FUSES_DEVCFG1) CAN0 Pin Enable Mask */
#define FUSES_DEVCFG1_CAN0_PIN_EN(value)      (FUSES_DEVCFG1_CAN0_PIN_EN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CAN0_PIN_EN_Pos)) /* Assigment of value for CAN0_PIN_EN in the FUSES_DEVCFG1 register */
#define FUSES_DEVCFG1_TRCEN_Pos               _UINT32_(5)                                          /* (FUSES_DEVCFG1) Trace Enable Position */
#define FUSES_DEVCFG1_TRCEN_Msk               (_UINT32_(0x1) << FUSES_DEVCFG1_TRCEN_Pos)           /* (FUSES_DEVCFG1) Trace Enable Mask */
#define FUSES_DEVCFG1_TRCEN(value)            (FUSES_DEVCFG1_TRCEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_TRCEN_Pos)) /* Assigment of value for TRCEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_TRCEN_OFF_Val         _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_TRCEN_ON_Val          _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_TRCEN_OFF               (FUSES_DEVCFG1_TRCEN_OFF_Val << FUSES_DEVCFG1_TRCEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_TRCEN_ON                (FUSES_DEVCFG1_TRCEN_ON_Val << FUSES_DEVCFG1_TRCEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CCL_OE_Pos              _UINT32_(6)                                          /* (FUSES_DEVCFG1) CCL Pads (via PPS) Output Enable Position */
#define FUSES_DEVCFG1_CCL_OE_Msk              (_UINT32_(0x1) << FUSES_DEVCFG1_CCL_OE_Pos)          /* (FUSES_DEVCFG1) CCL Pads (via PPS) Output Enable Mask */
#define FUSES_DEVCFG1_CCL_OE(value)           (FUSES_DEVCFG1_CCL_OE_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CCL_OE_Pos)) /* Assigment of value for CCL_OE in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CCL_OE_OFF_Val        _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CCL_OE_ON_Val         _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CCL_OE_OFF              (FUSES_DEVCFG1_CCL_OE_OFF_Val << FUSES_DEVCFG1_CCL_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CCL_OE_ON               (FUSES_DEVCFG1_CCL_OE_ON_Val << FUSES_DEVCFG1_CCL_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_ZBTWKSYS_Pos            _UINT32_(7)                                          /* (FUSES_DEVCFG1) ZBT Subsystem External Wake-up source Position */
#define FUSES_DEVCFG1_ZBTWKSYS_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_ZBTWKSYS_Pos)        /* (FUSES_DEVCFG1) ZBT Subsystem External Wake-up source Mask */
#define FUSES_DEVCFG1_ZBTWKSYS(value)         (FUSES_DEVCFG1_ZBTWKSYS_Msk & (_UINT32_(value) << FUSES_DEVCFG1_ZBTWKSYS_Pos)) /* Assigment of value for ZBTWKSYS in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_ZBTWKSYS_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_ZBTWKSYS_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_ZBTWKSYS_OFF            (FUSES_DEVCFG1_ZBTWKSYS_OFF_Val << FUSES_DEVCFG1_ZBTWKSYS_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_ZBTWKSYS_ON             (FUSES_DEVCFG1_ZBTWKSYS_ON_Val << FUSES_DEVCFG1_ZBTWKSYS_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP0_OE_Pos             _UINT32_(8)                                          /* (FUSES_DEVCFG1) Analog Comparator-0 Output Enable Position */
#define FUSES_DEVCFG1_CMP0_OE_Msk             (_UINT32_(0x1) << FUSES_DEVCFG1_CMP0_OE_Pos)         /* (FUSES_DEVCFG1) Analog Comparator-0 Output Enable Mask */
#define FUSES_DEVCFG1_CMP0_OE(value)          (FUSES_DEVCFG1_CMP0_OE_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CMP0_OE_Pos)) /* Assigment of value for CMP0_OE in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CMP0_OE_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CMP0_OE_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CMP0_OE_OFF             (FUSES_DEVCFG1_CMP0_OE_OFF_Val << FUSES_DEVCFG1_CMP0_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP0_OE_ON              (FUSES_DEVCFG1_CMP0_OE_ON_Val << FUSES_DEVCFG1_CMP0_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP1_OE_Pos             _UINT32_(9)                                          /* (FUSES_DEVCFG1) Analog Comparator-1 Output Enable Position */
#define FUSES_DEVCFG1_CMP1_OE_Msk             (_UINT32_(0x1) << FUSES_DEVCFG1_CMP1_OE_Pos)         /* (FUSES_DEVCFG1) Analog Comparator-1 Output Enable Mask */
#define FUSES_DEVCFG1_CMP1_OE(value)          (FUSES_DEVCFG1_CMP1_OE_Msk & (_UINT32_(value) << FUSES_DEVCFG1_CMP1_OE_Pos)) /* Assigment of value for CMP1_OE in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_CMP1_OE_OFF_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_CMP1_OE_ON_Val        _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_CMP1_OE_OFF             (FUSES_DEVCFG1_CMP1_OE_OFF_Val << FUSES_DEVCFG1_CMP1_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_CMP1_OE_ON              (FUSES_DEVCFG1_CMP1_OE_ON_Val << FUSES_DEVCFG1_CMP1_OE_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSPI_HSEN_Pos           _UINT32_(10)                                         /* (FUSES_DEVCFG1) QSPI (Direct) Enable Position */
#define FUSES_DEVCFG1_QSPI_HSEN_Msk           (_UINT32_(0x1) << FUSES_DEVCFG1_QSPI_HSEN_Pos)       /* (FUSES_DEVCFG1) QSPI (Direct) Enable Mask */
#define FUSES_DEVCFG1_QSPI_HSEN(value)        (FUSES_DEVCFG1_QSPI_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_QSPI_HSEN_Pos)) /* Assigment of value for QSPI_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_QSPI_HSEN_PPS_Val     _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_QSPI_HSEN_DIRECT_Val  _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_QSPI_HSEN_PPS           (FUSES_DEVCFG1_QSPI_HSEN_PPS_Val << FUSES_DEVCFG1_QSPI_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSPI_HSEN_DIRECT        (FUSES_DEVCFG1_QSPI_HSEN_DIRECT_Val << FUSES_DEVCFG1_QSPI_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM0_HSEN_Pos          _UINT32_(11)                                         /* (FUSES_DEVCFG1) SERCOM0 Direct (High Speed) Pin Enable Position */
#define FUSES_DEVCFG1_SCOM0_HSEN_Msk          (_UINT32_(0x1) << FUSES_DEVCFG1_SCOM0_HSEN_Pos)      /* (FUSES_DEVCFG1) SERCOM0 Direct (High Speed) Pin Enable Mask */
#define FUSES_DEVCFG1_SCOM0_HSEN(value)       (FUSES_DEVCFG1_SCOM0_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SCOM0_HSEN_Pos)) /* Assigment of value for SCOM0_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SCOM0_HSEN_PPS_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SCOM0_HSEN_DIRECT_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SCOM0_HSEN_PPS          (FUSES_DEVCFG1_SCOM0_HSEN_PPS_Val << FUSES_DEVCFG1_SCOM0_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM0_HSEN_DIRECT       (FUSES_DEVCFG1_SCOM0_HSEN_DIRECT_Val << FUSES_DEVCFG1_SCOM0_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM1_HSEN_Pos          _UINT32_(12)                                         /* (FUSES_DEVCFG1) SERCOM1 Direct (High Speed) Pin Enable Position */
#define FUSES_DEVCFG1_SCOM1_HSEN_Msk          (_UINT32_(0x1) << FUSES_DEVCFG1_SCOM1_HSEN_Pos)      /* (FUSES_DEVCFG1) SERCOM1 Direct (High Speed) Pin Enable Mask */
#define FUSES_DEVCFG1_SCOM1_HSEN(value)       (FUSES_DEVCFG1_SCOM1_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SCOM1_HSEN_Pos)) /* Assigment of value for SCOM1_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SCOM1_HSEN_PPS_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SCOM1_HSEN_DIRECT_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SCOM1_HSEN_PPS          (FUSES_DEVCFG1_SCOM1_HSEN_PPS_Val << FUSES_DEVCFG1_SCOM1_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM1_HSEN_DIRECT       (FUSES_DEVCFG1_SCOM1_HSEN_DIRECT_Val << FUSES_DEVCFG1_SCOM1_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM2_HSEN_Pos          _UINT32_(13)                                         /* (FUSES_DEVCFG1) SERCOM2 Direct (High Speed) Pin Enable Position */
#define FUSES_DEVCFG1_SCOM2_HSEN_Msk          (_UINT32_(0x1) << FUSES_DEVCFG1_SCOM2_HSEN_Pos)      /* (FUSES_DEVCFG1) SERCOM2 Direct (High Speed) Pin Enable Mask */
#define FUSES_DEVCFG1_SCOM2_HSEN(value)       (FUSES_DEVCFG1_SCOM2_HSEN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SCOM2_HSEN_Pos)) /* Assigment of value for SCOM2_HSEN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SCOM2_HSEN_PPS_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SCOM2_HSEN_DIRECT_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SCOM2_HSEN_PPS          (FUSES_DEVCFG1_SCOM2_HSEN_PPS_Val << FUSES_DEVCFG1_SCOM2_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SCOM2_HSEN_DIRECT       (FUSES_DEVCFG1_SCOM2_HSEN_DIRECT_Val << FUSES_DEVCFG1_SCOM2_HSEN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SMCLR_Pos               _UINT32_(14)                                         /* (FUSES_DEVCFG1) Selects CRU handling of MCLR Control Position */
#define FUSES_DEVCFG1_SMCLR_Msk               (_UINT32_(0x1) << FUSES_DEVCFG1_SMCLR_Pos)           /* (FUSES_DEVCFG1) Selects CRU handling of MCLR Control Mask */
#define FUSES_DEVCFG1_SMCLR(value)            (FUSES_DEVCFG1_SMCLR_Msk & (_UINT32_(value) << FUSES_DEVCFG1_SMCLR_Pos)) /* Assigment of value for SMCLR in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_SMCLR_NO_POR_Val      _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_SMCLR_FAUX_POR_Val    _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_SMCLR_NO_POR            (FUSES_DEVCFG1_SMCLR_NO_POR_Val << FUSES_DEVCFG1_SMCLR_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_SMCLR_FAUX_POR          (FUSES_DEVCFG1_SMCLR_FAUX_POR_Val << FUSES_DEVCFG1_SMCLR_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSCHE_EN_Pos            _UINT32_(15)                                         /* (FUSES_DEVCFG1) QSPI Address Space Cache Attribute Position */
#define FUSES_DEVCFG1_QSCHE_EN_Msk            (_UINT32_(0x1) << FUSES_DEVCFG1_QSCHE_EN_Pos)        /* (FUSES_DEVCFG1) QSPI Address Space Cache Attribute Mask */
#define FUSES_DEVCFG1_QSCHE_EN(value)         (FUSES_DEVCFG1_QSCHE_EN_Msk & (_UINT32_(value) << FUSES_DEVCFG1_QSCHE_EN_Pos)) /* Assigment of value for QSCHE_EN in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_QSCHE_EN_OFF_Val      _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_QSCHE_EN_ON_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_QSCHE_EN_OFF            (FUSES_DEVCFG1_QSCHE_EN_OFF_Val << FUSES_DEVCFG1_QSCHE_EN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_QSCHE_EN_ON             (FUSES_DEVCFG1_QSCHE_EN_ON_Val << FUSES_DEVCFG1_QSCHE_EN_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMFTRIM_Pos          _UINT32_(16)                                         /* (FUSES_DEVCFG1) USB DM Fall Trim fuse bits Position */
#define FUSES_DEVCFG1_USBDMFTRIM_Msk          (_UINT32_(0x3) << FUSES_DEVCFG1_USBDMFTRIM_Pos)      /* (FUSES_DEVCFG1) USB DM Fall Trim fuse bits Mask */
#define FUSES_DEVCFG1_USBDMFTRIM(value)       (FUSES_DEVCFG1_USBDMFTRIM_Msk & (_UINT32_(value) << FUSES_DEVCFG1_USBDMFTRIM_Pos)) /* Assigment of value for USBDMFTRIM in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_USBDMFTRIM_DEFAULT_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDMFTRIM_SLOWER_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDMFTRIM_SLIGH_FASTER_Val _UINT32_(0x2)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDMFTRIM_SLIGH_SLOWER_Val _UINT32_(0x3)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_USBDMFTRIM_DEFAULT      (FUSES_DEVCFG1_USBDMFTRIM_DEFAULT_Val << FUSES_DEVCFG1_USBDMFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMFTRIM_SLOWER       (FUSES_DEVCFG1_USBDMFTRIM_SLOWER_Val << FUSES_DEVCFG1_USBDMFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMFTRIM_SLIGH_FASTER (FUSES_DEVCFG1_USBDMFTRIM_SLIGH_FASTER_Val << FUSES_DEVCFG1_USBDMFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMFTRIM_SLIGH_SLOWER (FUSES_DEVCFG1_USBDMFTRIM_SLIGH_SLOWER_Val << FUSES_DEVCFG1_USBDMFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMRTRIM_Pos          _UINT32_(18)                                         /* (FUSES_DEVCFG1) USB DM Rise Trim fuse bits Position */
#define FUSES_DEVCFG1_USBDMRTRIM_Msk          (_UINT32_(0x3) << FUSES_DEVCFG1_USBDMRTRIM_Pos)      /* (FUSES_DEVCFG1) USB DM Rise Trim fuse bits Mask */
#define FUSES_DEVCFG1_USBDMRTRIM(value)       (FUSES_DEVCFG1_USBDMRTRIM_Msk & (_UINT32_(value) << FUSES_DEVCFG1_USBDMRTRIM_Pos)) /* Assigment of value for USBDMRTRIM in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_USBDMRTRIM_DEFAULT_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDMRTRIM_SLIGH_FASTER_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDMRTRIM_FASTER_Val _UINT32_(0x2)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDMRTRIM_SLOWER_Val _UINT32_(0x3)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_USBDMRTRIM_DEFAULT      (FUSES_DEVCFG1_USBDMRTRIM_DEFAULT_Val << FUSES_DEVCFG1_USBDMRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMRTRIM_SLIGH_FASTER (FUSES_DEVCFG1_USBDMRTRIM_SLIGH_FASTER_Val << FUSES_DEVCFG1_USBDMRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMRTRIM_FASTER       (FUSES_DEVCFG1_USBDMRTRIM_FASTER_Val << FUSES_DEVCFG1_USBDMRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDMRTRIM_SLOWER       (FUSES_DEVCFG1_USBDMRTRIM_SLOWER_Val << FUSES_DEVCFG1_USBDMRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPFTRIM_Pos          _UINT32_(20)                                         /* (FUSES_DEVCFG1) USB DP Fall Trim fuse bits Position */
#define FUSES_DEVCFG1_USBDPFTRIM_Msk          (_UINT32_(0x3) << FUSES_DEVCFG1_USBDPFTRIM_Pos)      /* (FUSES_DEVCFG1) USB DP Fall Trim fuse bits Mask */
#define FUSES_DEVCFG1_USBDPFTRIM(value)       (FUSES_DEVCFG1_USBDPFTRIM_Msk & (_UINT32_(value) << FUSES_DEVCFG1_USBDPFTRIM_Pos)) /* Assigment of value for USBDPFTRIM in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_USBDPFTRIM_DEFAULT_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDPFTRIM_SLOWER_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDPFTRIM_SLIGH_FASTER_Val _UINT32_(0x2)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDPFTRIM_SLIGH_SLOWER_Val _UINT32_(0x3)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_USBDPFTRIM_DEFAULT      (FUSES_DEVCFG1_USBDPFTRIM_DEFAULT_Val << FUSES_DEVCFG1_USBDPFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPFTRIM_SLOWER       (FUSES_DEVCFG1_USBDPFTRIM_SLOWER_Val << FUSES_DEVCFG1_USBDPFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPFTRIM_SLIGH_FASTER (FUSES_DEVCFG1_USBDPFTRIM_SLIGH_FASTER_Val << FUSES_DEVCFG1_USBDPFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPFTRIM_SLIGH_SLOWER (FUSES_DEVCFG1_USBDPFTRIM_SLIGH_SLOWER_Val << FUSES_DEVCFG1_USBDPFTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPRTRIM_Pos          _UINT32_(22)                                         /* (FUSES_DEVCFG1) USB DP Rise Trim fuse bits Position */
#define FUSES_DEVCFG1_USBDPRTRIM_Msk          (_UINT32_(0x3) << FUSES_DEVCFG1_USBDPRTRIM_Pos)      /* (FUSES_DEVCFG1) USB DP Rise Trim fuse bits Mask */
#define FUSES_DEVCFG1_USBDPRTRIM(value)       (FUSES_DEVCFG1_USBDPRTRIM_Msk & (_UINT32_(value) << FUSES_DEVCFG1_USBDPRTRIM_Pos)) /* Assigment of value for USBDPRTRIM in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_USBDPRTRIM_DEFAULT_Val _UINT32_(0x0)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDPRTRIM_SLIGH_FASTER_Val _UINT32_(0x1)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDPRTRIM_FASTER_Val _UINT32_(0x2)                                        /* (FUSES_DEVCFG1)   */
#define   FUSES_DEVCFG1_USBDPRTRIM_SLOWER_Val _UINT32_(0x3)                                        /* (FUSES_DEVCFG1)   */
#define FUSES_DEVCFG1_USBDPRTRIM_DEFAULT      (FUSES_DEVCFG1_USBDPRTRIM_DEFAULT_Val << FUSES_DEVCFG1_USBDPRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPRTRIM_SLIGH_FASTER (FUSES_DEVCFG1_USBDPRTRIM_SLIGH_FASTER_Val << FUSES_DEVCFG1_USBDPRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPRTRIM_FASTER       (FUSES_DEVCFG1_USBDPRTRIM_FASTER_Val << FUSES_DEVCFG1_USBDPRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_USBDPRTRIM_SLOWER       (FUSES_DEVCFG1_USBDPRTRIM_SLOWER_Val << FUSES_DEVCFG1_USBDPRTRIM_Pos) /* (FUSES_DEVCFG1)  Position  */
#define FUSES_DEVCFG1_WDTPSS_Pos              _UINT32_(24)                                         /* (FUSES_DEVCFG1) Watchdog Timer Post-scale Select Sleep Position */
#define FUSES_DEVCFG1_WDTPSS_Msk              (_UINT32_(0x1F) << FUSES_DEVCFG1_WDTPSS_Pos)         /* (FUSES_DEVCFG1) Watchdog Timer Post-scale Select Sleep Mask */
#define FUSES_DEVCFG1_WDTPSS(value)           (FUSES_DEVCFG1_WDTPSS_Msk & (_UINT32_(value) << FUSES_DEVCFG1_WDTPSS_Pos)) /* Assigment of value for WDTPSS in the FUSES_DEVCFG1 register */
#define   FUSES_DEVCFG1_WDTPSS_PSS1_Val       _UINT32_(0x0)                                        /* (FUSES_DEVCFG1) 1:1  */
#define   FUSES_DEVCFG1_WDTPSS_PSS2_Val       _UINT32_(0x1)                                        /* (FUSES_DEVCFG1) 1:2  */
#define   FUSES_DEVCFG1_WDTPSS_PSS4_Val       _UINT32_(0x2)                                        /* (FUSES_DEVCFG1) 1:4  */
#define   FUSES_DEVCFG1_WDTPSS_PSS8_Val       _UINT32_(0x3)                                        /* (FUSES_DEVCFG1) 1:8  */
#define   FUSES_DEVCFG1_WDTPSS_PSS16_Val      _UINT32_(0x4)                                        /* (FUSES_DEVCFG1) 1:16  */
#define   FUSES_DEVCFG1_WDTPSS_PSS32_Val      _UINT32_(0x5)                                        /* (FUSES_DEVCFG1) 1:32  */
#define   FUSES_DEVCFG1_WDTPSS_PSS64_Val      _UINT32_(0x6)                                        /* (FUSES_DEVCFG1) 1:64  */
#define   FUSES_DEVCFG1_WDTPSS_PSS128_Val     _UINT32_(0x7)                                        /* (FUSES_DEVCFG1) 1:128  */
#define   FUSES_DEVCFG1_WDTPSS_PSS256_Val     _UINT32_(0x8)                                        /* (FUSES_DEVCFG1) 1:256  */
#define   FUSES_DEVCFG1_WDTPSS_PSS512_Val     _UINT32_(0x9)                                        /* (FUSES_DEVCFG1) 1:512  */
#define   FUSES_DEVCFG1_WDTPSS_PSS1024_Val    _UINT32_(0xA)                                        /* (FUSES_DEVCFG1) 1:1024  */
#define   FUSES_DEVCFG1_WDTPSS_PSS2048_Val    _UINT32_(0xB)                                        /* (FUSES_DEVCFG1) 1:2048  */
#define   FUSES_DEVCFG1_WDTPSS_PSS4096_Val    _UINT32_(0xC)                                        /* (FUSES_DEVCFG1) 1:4096  */
#define   FUSES_DEVCFG1_WDTPSS_PSS8192_Val    _UINT32_(0xD)                                        /* (FUSES_DEVCFG1) 1:8192  */
#define   FUSES_DEVCFG1_WDTPSS_PSS16384_Val   _UINT32_(0xE)                                        /* (FUSES_DEVCFG1) 1:16384  */
#define   FUSES_DEVCFG1_WDTPSS_PSS32768_Val   _UINT32_(0xF)                                        /* (FUSES_DEVCFG1) 1:32768  */
#define   FUSES_DEVCFG1_WDTPSS_PSS65536_Val   _UINT32_(0x10)                                       /* (FUSES_DEVCFG1) 1:65536  */
#define   FUSES_DEVCFG1_WDTPSS_PSS131072_Val  _UINT32_(0x11)                                       /* (FUSES_DEVCFG1) 1:131072  */
#define   FUSES_DEVCFG1_WDTPSS_PSS262144_Val  _UINT32_(0x12)                                       /* (FUSES_DEVCFG1) 1:262144  */
#define   FUSES_DEVCFG1_WDTPSS_PSS524288_Val  _UINT32_(0x13)                                       /* (FUSES_DEVCFG1) 1:524288  */
#define   FUSES_DEVCFG1_WDTPSS_PSS1048576_Val _UINT32_(0x14)                                       /* (FUSES_DEVCFG1) 1:1048576  */
#define FUSES_DEVCFG1_WDTPSS_PSS1             (FUSES_DEVCFG1_WDTPSS_PSS1_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:1 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS2             (FUSES_DEVCFG1_WDTPSS_PSS2_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:2 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS4             (FUSES_DEVCFG1_WDTPSS_PSS4_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:4 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS8             (FUSES_DEVCFG1_WDTPSS_PSS8_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:8 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS16            (FUSES_DEVCFG1_WDTPSS_PSS16_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:16 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS32            (FUSES_DEVCFG1_WDTPSS_PSS32_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:32 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS64            (FUSES_DEVCFG1_WDTPSS_PSS64_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:64 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS128           (FUSES_DEVCFG1_WDTPSS_PSS128_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:128 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS256           (FUSES_DEVCFG1_WDTPSS_PSS256_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:256 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS512           (FUSES_DEVCFG1_WDTPSS_PSS512_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:512 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS1024          (FUSES_DEVCFG1_WDTPSS_PSS1024_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:1024 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS2048          (FUSES_DEVCFG1_WDTPSS_PSS2048_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:2048 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS4096          (FUSES_DEVCFG1_WDTPSS_PSS4096_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:4096 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS8192          (FUSES_DEVCFG1_WDTPSS_PSS8192_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:8192 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS16384         (FUSES_DEVCFG1_WDTPSS_PSS16384_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:16384 Position  */
#define FUSES_DEVCFG1_WDTPSS_PSS32768         (FUSES_DEVCFG1_WDTPSS_PSS32768_Val << FUSES_DEVCFG1_WDTPSS_Pos) /* (FUSES_DEVCFG1) 1:32768 Position  */
